package flagday

import "testing"

func TestHappyMondayBefore(t *testing.T) {
	testdata := []expected{
		{1, 1, "元日"},
		{1, 15, "成人の日"},
		{2, 11, "建国記念の日"},
		{3, 21, "春分の日"},
		{3, 22, "振替休日"},
		{4, 29, "みどりの日"},
		{5, 3, "憲法記念日"},
		{5, 4, "国民の休日"},
		{5, 5, "こどもの日"},
		{7, 20, "海の日"},
		{9, 15, "敬老の日"},
		{9, 23, "秋分の日"},
		{10, 10, "体育の日"},
		{10, 11, "振替休日"},
		{11, 3, "文化の日"},
		{11, 23, "勤労感謝の日"},
		{12, 23, "天皇誕生日"},
	}
	year := 1999
	dates := InYear(year)
	check(t, year, dates, testdata)
}

func TestHappyMonday1st(t *testing.T) {
	testdata := []expected{
		{1, 1, "元日"},
		{1, 10, "成人の日"}, // changed
		{2, 11, "建国記念の日"},
		{3, 20, "春分の日"},
		{4, 29, "みどりの日"},
		{5, 3, "憲法記念日"},
		{5, 4, "国民の休日"},
		{5, 5, "こどもの日"},
		{7, 20, "海の日"},
		{9, 15, "敬老の日"},
		{9, 23, "秋分の日"},
		{10, 9, "体育の日"}, // changed
		{11, 3, "文化の日"},
		{11, 23, "勤労感謝の日"},
		{12, 23, "天皇誕生日"},
	}
	year := 2000
	dates := InYear(year)
	check(t, year, dates, testdata)
}

func TestHappyMonday2nd(t *testing.T) {
	testdata := []expected{
		{1, 1, "元日"},
		{1, 13, "成人の日"},
		{2, 11, "建国記念の日"},
		{3, 21, "春分の日"},
		{4, 29, "みどりの日"},
		{5, 3, "憲法記念日"},
		{5, 4, "国民の休日"},
		{5, 5, "こどもの日"},
		{7, 21, "海の日"}, // changed
		{9, 15, "敬老の日"},
		{9, 23, "秋分の日"},
		{10, 13, "体育の日"},
		{11, 3, "文化の日"},
		{11, 23, "勤労感謝の日"},
		{11, 24, "振替休日"},
		{12, 23, "天皇誕生日"},
	}
	year := 2003
	dates := InYear(year)
	check(t, year, dates, testdata)

	testdata = []expected{
		{1, 1, "元日"},
		{1, 12, "成人の日"},
		{2, 11, "建国記念の日"},
		{3, 20, "春分の日"},
		{4, 29, "みどりの日"},
		{5, 3, "憲法記念日"},
		{5, 4, "国民の休日"},
		{5, 5, "こどもの日"},
		{7, 19, "海の日"},
		{9, 20, "敬老の日"}, // changed
		{9, 23, "秋分の日"},
		{10, 11, "体育の日"},
		{11, 3, "文化の日"},
		{11, 23, "勤労感謝の日"},
		{12, 23, "天皇誕生日"},
	}
	year = 2004
	dates = InYear(year)
	check(t, year, dates, testdata)
}
